Revit 2026 API

# NoiseNoiseLevels Property

---

The property labeled "Levels" from the "Noise" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string NoiseLevels { get; }
```
```vb
Public Shared ReadOnly Property NoiseLevels As String
	Get
```
```cpp
public:
static property String^ NoiseLevels {
	String^ get ();
}
```
```fsharp
static member NoiseLevels : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "1, 10".

#### Reference

Noise Class

Autodesk.Revit.DB.Visual Namespace